[
  {
    "id": "doc_001",
    "title": "Diabetes Management Guidelines",
    "text": "Type 2 diabetes is a chronic condition that affects the way your body metabolizes sugar (glucose). Symptoms include increased thirst, frequent urination, hunger, fatigue, and blurred vision. Treatment involves lifestyle changes, medication, and regular monitoring of blood glucose levels. Metformin is often the first-line treatment for type 2 diabetes."
  },
  {
    "id": "doc_002",
    "title": "COVID-19 Transmission and Prevention",
    "text": "COVID-19 is primarily transmitted through respiratory droplets when an infected person coughs, sneezes, or talks. The virus can also spread through airborne transmission in poorly ventilated spaces. Prevention measures include wearing masks, maintaining social distance, frequent hand washing, and vaccination. Symptoms range from mild to severe and may include fever, cough, shortness of breath, and loss of taste or smell."
  },
  {
    "id": "doc_003",
    "title": "Hypertension Treatment Protocol",
    "text": "Hypertension, or high blood pressure, is defined as blood pressure readings consistently above 140/90 mmHg. It is often called the 'silent killer' because it typically has no symptoms. Treatment includes lifestyle modifications such as reducing sodium intake, regular exercise, weight management, and limiting alcohol consumption. Medications like ACE inhibitors, diuretics, and beta-blockers may be prescribed."
  },
  {
    "id": "doc_004",
    "title": "Aspirin Side Effects and Contraindications",
    "text": "Aspirin is commonly used for pain relief and cardiovascular protection. However, it can cause several side effects including stomach irritation, gastric ulcers, and increased bleeding risk. Contraindications include active peptic ulcer disease, severe liver disease, and allergy to salicylates. Patients should be monitored for signs of gastrointestinal bleeding when on long-term aspirin therapy."
  },
  {
    "id": "doc_005",
    "title": "Immune System Function and Disorders",
    "text": "The immune system is the body's defense mechanism against infections and diseases. It consists of white blood cells, antibodies, and other components that work together to identify and eliminate pathogens. The immune system has two main parts: innate immunity (immediate response) and adaptive immunity (specific, long-lasting response). Immunodeficiency disorders can make individuals more susceptible to infections."
  },
  {
    "id": "doc_006",
    "title": "Antibiotic Resistance in Healthcare",
    "text": "Antibiotic resistance occurs when bacteria develop the ability to survive exposure to antibiotics that would normally kill them. This is a growing global health threat. Causes include overuse and misuse of antibiotics, poor infection control practices, and inadequate sanitation. Prevention strategies include appropriate antibiotic prescribing, completing full courses of treatment, and implementing infection control measures in healthcare settings."
  },
  {
    "id": "doc_007",
    "title": "Mental Health and Depression Treatment",
    "text": "Depression is a common mental health disorder characterized by persistent sadness, loss of interest, and impaired daily functioning. Symptoms may include changes in appetite, sleep disturbances, fatigue, and difficulty concentrating. Treatment options include psychotherapy, antidepressant medications, and lifestyle interventions. Cognitive behavioral therapy (CBT) and selective serotonin reuptake inhibitors (SSRIs) are commonly used treatments."
  },
  {
    "id": "doc_008",
    "title": "Cardiovascular Disease Prevention",
    "text": "Cardiovascular disease is the leading cause of death worldwide. Risk factors include high blood pressure, high cholesterol, smoking, diabetes, obesity, and sedentary lifestyle. Prevention strategies include regular physical activity, healthy diet rich in fruits and vegetables, smoking cessation, stress management, and regular health screenings. Statins may be prescribed to lower cholesterol levels in high-risk patients."
  },
  {
    "id": "doc_009",
    "title": "Cancer Screening Guidelines",
    "text": "Early detection through screening can significantly improve cancer outcomes. Mammograms are recommended for breast cancer screening in women aged 50-74. Colonoscopy is recommended for colorectal cancer screening starting at age 50. Pap smears are used for cervical cancer screening in women aged 21-65. Lung cancer screening with low-dose CT is recommended for high-risk individuals with smoking history."
  },
  {
    "id": "doc_010",
    "title": "Vaccination Schedule and Importance",
    "text": "Vaccines are one of the most effective public health interventions for preventing infectious diseases. The childhood vaccination schedule includes vaccines for measles, mumps, rubella, polio, hepatitis B, and others. Adult vaccines include annual influenza vaccine, COVID-19 vaccines, and boosters for tetanus and diphtheria. Herd immunity occurs when a large portion of the population becomes immune, protecting vulnerable individuals."
  }
]